WebService/app/controllers/api/v1/courses_controller.rb

SELECT "courses".* FROM "courses"  WHERE "courses"."user_id" = 1
---
	def index
		@courses = Course.find_by user: current_user

INSERT INTO "courses" ("created_at", "description", "end", "name", "start", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@course = Course.new create_params
		@course.user = current_user

		if @course.save