WebService/app/controllers/api/v1/groups_controller.rb

INSERT INTO "groups" ("admin", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["admin", 2], ["created_at", "2014-11-12 23:09:25.987082"], ["name", "me lo chupan yaaa"], ["updated_at", "2014-11-12 23:09:25.987082"]]
---
  def create
    @group = Group.new create_params
    @group.admin = current_user.id

    if @group.save

SELECT "usergroups".* FROM "usergroups"  WHERE "usergroups"."user_id" IS NULL
---
  def index
    @groups = Usergroup.where user: current_user

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'molayab' LIMIT 1
INSERT INTO "usergroups" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-21 19:16:29.496770"], ["group_id", 3], ["updated_at", "2014-11-21 19:16:29.496770"], ["user_id", 1]]
---
  def add_user
    @group = Usergroup.new

    user = User.find_by username: params[:username]

    if user
      @group.user = user
      @group.group_id = params[:id]

      if @group.save