WebService/app/controllers/api/v1/notes_controller.rb

	def update
		course = Course.find_by id: params[:id], user: current_user
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = 1 AND "courses"."user_id" = 1 LIMIT 1