WebService/app/controllers/api/v1/notes_controller.rb

def index
	has_many = false

	if params[:friends]
		friends = Friend.where user_id: current_user.id

		@notes = Note.where published: true
		@notes2 = []
		@notes.each do |x|
			usrname = x.username
			friends.each do |y|
				if y.username == usrname
					@notes2 << x
				end
			end
		end
		p @notes2
		render json: {success: true, notes: @notes2}
	else
		if params[:search]
			course = Note.where ["tags LIKE ?", "%#{params[:search]}%"]
			has_many = true
		else
			course = Course.find_by id: params[:id], user: current_user
---
SELECT "friends".* FROM "friends"  WHERE "friends"."user_id" = 2
SELECT "notes".* FROM "notes"  WHERE "notes"."published" = 't'
SELECT "notes".* FROM "notes"  WHERE (tags LIKE '%mateo%' and user_id not equal 2)
SELECT "notes".* FROM "notes"  WHERE "notes"."course_id" = ?  [["course_id", 10]]
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" IS NULL AND "courses"."user_id" = 1 LIMIT 1

	def create
		course = Course.find_by id: params[:id], user: current_user
		ok = false
		ok = true if params[:id] == 0
		if course || ok
			@note = Note.new create_params
			@note.username = current_user.username
			@note.course_id = course.id
			@note.published = false
			if @note.save!
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = 10 AND "courses"."user_id" = 4 LIMIT 1
INSERT INTO "notes" ("course_id", "created_at", "pattern", "published", "title", "updated_at", "words") VALUES (?, ?, ?, ?, ?, ?, ?)  [["course_id", 1], ["created_at", "2014-10-25 21:38:59.052434"], ["pattern", "stripped"], ["published", "f"], ["title", "ejemplko"], ["updated_at", "2014-10-25 21:38:59.052434"], ["words", ""]]

	def update
			@note = Note.find params[:note_id]

			@note.update create_params
---
SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "notes" SET "published" = ?, "tags" = ?, "updated_at" = ? WHERE "notes"."id" = 9  [["published", "f"], ["tags", ""], ["updated_at", "2014-10-25 22:22:15.588821"]]

	def show
			@note = Note.find params[:id]
---
SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = ? LIMIT 1  [["id", 5]]

	def index_group
		@notes = Note.where group_id: params[:id]
---
SELECT "notes".* FROM "notes"  WHERE "notes"."group_id" = 1