WebService/app/controllers/api/v1/pals_controller.rb

SELECT  1 AS one FROM "users"  WHERE "users"."username" = 'plop' LIMIT 1
INSERT INTO "friends" ("created_at", "updated_at", "user_id", "username") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-11 19:58:33.038246"], ["updated_at", "2014-11-11 19:58:33.038246"], ["user_id", 1], ["username", "santicarmo"]]
---
def create
  if User.all.exists? username: create_params[:username]
    @friend = Friend.new create_params
    if @friend.save