WebService/app/controllers/api/v1/reminders_controller.rb

INSERT INTO "reminders" ("created_at", "deadline", "done", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-28 19:51:58.852075"], ["deadline", "2013-10-10"], ["done", "f"], ["title", "tarea de ungles"], ["updated_at", "2014-10-28 19:51:58.852075"], ["user_id", 2]]
---
  def create
    exc = false
    @reminder = Reminder.new create_params
    @reminder.user = current_user
    @reminder.done = false
    begin
      @reminder.deadline = DateTime.parse create_params[:deadline]
    rescue
      exc = true
      render json:{success: false, errors: ["Formato de fecha invalido"]}
    end
    if @reminder.save

SELECT "reminders".* FROM "reminders"  WHERE "reminders"."user_id" = 1
---
  def index
    @reminders = Reminder.where user: current_user

SELECT  "reminders".* FROM "reminders"  WHERE "reminders"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "reminders" WHERE "reminders"."id" = 6
---
  def destroy
    @reminder = Reminder.find params[:id]
    if @reminder.delete

SELECT  "reminders".* FROM "reminders"  WHERE "reminders"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "reminders" SET "done" = ?, "updated_at" = ? WHERE "reminders"."id" = 3  [["done", "f"], ["updated_at", "2014-10-28 21:00:24.475617"]]
---
  def update
      @reminder = Reminder.find params[:id]
      if @reminder.update update_params