WebService/app/controllers/api/v1/schedules_controller.rb

INSERT INTO "schedules" ("classroom", "course_id", "created_at", "time", "updated_at", "weekday") VALUES (?, ?, ?, ?, ?, ?)  [["classroom", "35401"], ["course_id", 18], ["created_at", "2014-11-03 19:24:15.026210"], ["time", "2000-01-01 03:00:00.000000"], ["updated_at", "2014-11-03 19:24:15.026210"], ["weekday", "W"]]
---
  def create
    @schedule = Schedule.new create_params
    if @schedule.save

SELECT "schedules".* FROM "schedules"  WHERE "schedules"."course_id" = 1
---
  def show
    @schedules = Schedule.where course_id: params[:id]