WebService/app/controllers/api/v1/shares_controller.rb

  def index
    @shares = Share.where user: current_user
---
SELECT "shares".* FROM "shares"  WHERE "shares"."user_id" = 1

  def create
    @share = Share.new create_params
    if @share.save
---
INSERT INTO "shares" ("created_at", "note_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-21 21:21:25.786341"], ["note_id", 1], ["updated_at", "2014-10-21 21:21:25.786341"], ["user_id", 1]]