WebService/app/controllers/api/v1/usergroups_controller.rb

  def create
    @usergroup = Usergroup.new create_params
    @usergroup.group_id = Group.last.id
    if @usergroup.save
---
SELECT  "groups".* FROM "groups"   ORDER BY "groups"."id" DESC LIMIT 1
INSERT INTO "usergroups" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-19 21:09:24.306055"], ["group_id", 3], ["updated_at", "2014-11-19 21:09:24.306055"], ["user_id", 1]]

  def destroy_2
    @user = User.find_by username: params[:username]
    if @user
      @group = Usergroup.find_by user_id: @user.id, group_id: params[:id]
      if @group.delete
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'santicarmo' AND "users"."group_id" = '1' LIMIT 1
SELECT  "usergroups".* FROM "usergroups"  WHERE "usergroups"."user_id" = 2 AND "usergroups"."group_id" = 1 LIMIT 1
DELETE FROM "usergroups" WHERE "usergroups"."id" = 8