WebService/app/controllers/api/v1/users_controller.rb

	def create
		@user = User.create register_params
---
INSERT INTO "users" ("created_at", "email", "name", "password_encrypted", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		if true
			@user = User.find_by id: current_user.id
			@user.update update_params
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "description" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["description", "SU MAMA,"], ["updated_at", "2014-10-14 21:45:02.235246"]]

	def user_id_by_username
		x = User.find_by username: params[:id]
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'maestro252' LIMIT 1